## How to read csv

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('data.csv')

In [3]:
df

,Date,Open,High,Low,Close,Shares Traded,Turnover (Rs. Cr)
0,01-Jun-20,9726.85,9931.60,9706.95,9826.15,794183122,38096.92
1,02-Jun-20,9880.85,9995.60,9824.05,9979.10,770192848,36723.11
2,03-Jun-20,10108.30,10176.20,10035.55,10061.55,794664422,38343.61
3,04-Jun-20,10054.25,10123.85,9944.25,10029.10,775106567,36399.04
4,05-Jun-20,10093.80,10177.80,10040.75,10142.15,987122302,37824.63
...,...,...,...,...,...,...,...
91,07-Oct-20,11679.25,11763.05,11629.35,11738.85,513367516,32935.98
92,08-Oct-20,11835.40,11905.70,11791.15,11834.60,608768573,38677.49
93,09-Oct-20,11852.05,11938.60,11805.20,11914.20,611079482,34546.80
94,12-Oct-20,11973.55,12022.05,11867.20,11930.95,522627571,26586.47
95,13-Oct-20,11934.65,11988.20,11888.90,11934.50,458304851,29403.22

In [4]:
df.head()

,Date,Open,High,Low,Close,Shares Traded,Turnover (Rs. Cr)
0,01-Jun-20,9726.85,9931.60,9706.95,9826.15,794183122,38096.92
1,02-Jun-20,9880.85,9995.60,9824.05,9979.10,770192848,36723.11
2,03-Jun-20,10108.30,10176.20,10035.55,10061.55,794664422,38343.61
3,04-Jun-20,10054.25,10123.85,9944.25,10029.10,775106567,36399.04
4,05-Jun-20,10093.80,10177.80,10040.75,10142.15,987122302,37824.63

In [5]:
print(df['Turnover (Rs. Cr)'].dtype)

float64

In [6]:
print(df['Turnover (Rs. Cr)'])

0     38096.92
1     36723.11
2     38343.61
3     36399.04
4     37824.63
        ...
91    32935.98
92    38677.49
93    34546.80
94    26586.47
95    29403.22
Name: Turnover (Rs. Cr), Length: 96, dtype: float64

In [7]:
df['Low'].astype('category')   #it reduces the size of Dataframe (df)

0      9706.95
1      9824.05
2     10035.55
3      9944.25
4     10040.75
        ...
91    11629.35
92    11791.15
93    11805.20
94    11867.20
95    11888.90
Name: Low, Length: 96, dtype: category
Categories (96, float64): [9544.35, 9706.95, 9726.35, 9728.50, ..., 11791.15, 11805.20, 11867.20, 11888.90]

## How to Write Csv in pandas

In [12]:
hf = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[45,78,96,10]],columns=['A','B','C','D'])

In [13]:
hf.head()

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  45  78  96  10

In [11]:
hf.to_csv('export.csv',index=False)

In [14]:
hf1 = pd.DataFrame([[11,2,33,44],[55,6,77,88],[19,10,18,62],[45,78,96,10]],columns=['X','Y','Z','W'])

In [15]:
hf1

    X   Y   Z   W
0  11   2  33  44
1  55   6  77  88
2  19  10  18  62
3  45  78  96  10

In [19]:
hf3 = pd.merge(hf,hf1,right_on='Y',left_on='B')   #merging two dataframes

In [20]:
hf3

    A   B   C   D   X   Y   Z   W
0   1   2   3   4  11   2  33  44
1   5   6   7   8  55   6  77  88
2   9  10  11  12  19  10  18  62
3  45  78  96  10  45  78  96  10